#判斷式
if True :
    print("如果是True，就會顯示執行")

if False :
    print("XXXXXXXXXXX") #因為是False所以不會顯示這段
#==================================================================    
if True :
    print("如果是True，就會顯示執行") #因為是True所以顯示這段
else :
    print("如果是False，就會顯示執行這段") 
#=================================================================
if False :
    print("如果是True，就會顯示執行")
else :
    print("如果是False，就會顯示執行這段") #因為是False所以顯示這段
#====================================================================
X=input("請輸入數字: ") #使用者輸入後，是以字串的形式表示
X=int(X) #將字串轉換成數字型態
if X>100 : #會判斷後回傳布林值
    print("大於100")
elif X>50 :
    print("大於50，小於等於100")
else :
    print("小於等於50")
#=========================================
#四則運算
n1=int(input("請輸入數字一: "))
n2=int(input("請輸入數字二: "))
op=input("請輸入運算: +, -, *, / :")
if op=="+" :             #程式語言中=代表給值，兩次==才是判斷。 x=1是指把1的值給x，而x==1是判斷x是不是等於1。
       print(n1+n2)
elif op=="-" :
       print(n1-n2)
elif op=="*" :
       print(n1*n2)
elif op=="/" :
       print(n1/n2)
else:
       print("不要亂輸入")











