print("Hello Worlds")
#撰寫程式的副檔名都是用.py
#下方終端機可以輸入 python start.py就能直接執行
#方向建按上，可以自動記錄上次跑過的指令
#清空終端機畫面 CLS

#布林值，代表正確或是錯誤，要注意大小寫
True
False

#有順序、可動的的列表 List 中括弧搭配逗號
[1,2,3]
["字串","字串"]

#有順序、不可動的列表 Tuple 小括號搭配逗號
(1,2,3)
("字串","字串")

#集合 Set 大括號搭配逗號 (集合沒有順序的概念，列表才有)
{1,2,3}
{"字串","字串"}

#字典 Dictionary 鍵(key)跟值(value)的配對
{"鍵":"key","值":"vlaue"}

#變數=資料 
#變數 可以隨便自己取名稱，但是開頭只能用英文
#資料 只要按邏輯寫，中文還是數字都可以
test1=1234
X="apple"
print(test1)
print(X)
#變數很彈性可以直接取代舊的資料
X=True
print(X)
X={1,2,3}
print(X)

#若沒按照邏輯寫，執行會發生錯誤，會顯示第40行錯誤
sdfsdfsdfsdfcl